cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xd.svd
        <!-- REGISTER "RCLESW" -->
        <register>
          <name>RCLESW</name>
          <description>Minimum Data Bit Width Setting Register</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "RCLELW" -->
        <register>
          <name>RCLELW</name>
          <description>Maximum Data Bit Width Setting Register</description>
          <addressOffset>0x65</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HDMICEC1" -->
    <peripheral derivedFrom="HDMICEC0">
      <name>HDMICEC1</name>
      <baseAddress>0x40034100</baseAddress>
      <description>HDMI-CEC ch.1</description>
      <version>A</version>
      <!-- INTERRUPT "HDMICEC0_1" -->
      <interrupt>
        <name>HDMICEC0_1</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "LVD" -->
    <peripheral>
      <name>LVD</name>
      <description>Low-voltage Detection</description>
      <version>C</version>
      <groupName>LVD</groupName>
      <baseAddress>0x40035000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CSV_SWDT_LVD" -->
      <interrupt>
        <name>CSV_SWDT_LVD</name>
        <value>0</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LVD_CTL" -->
        <register>
          <name>LVD_CTL</name>
          <description>Low-voltage Detection Voltage Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x800C</resetValue>
          <resetMask>0x80FC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDRE" -->
            <field>
              <name>LVDRE</name>
              <description>Low-voltage detection reset operation enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description>Low-voltage detection interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHI" -->
            <field>
              <name>SVHI</name>
              <description>Low-voltage detection interrupt voltage setting bits</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR" -->
        <register>
          <name>LVD_STR</name>
          <description>Low-voltage Detection Interrupt Factor Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0101</resetValue>
          <resetMask>0x8181</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVD2IR" -->
            <field>
              <name>LVD2IR</name>
              <description>Low-voltage detection 2 interrupt factor bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVD2HSTR" -->
            <field>
              <name>LVD2HSTR</name>
              <description>Voltage of VCC is higher than the setting of SVH2RLI</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVDIR" -->
            <field>
              <name>LVDIR</name>
              <description>Low-voltage detection interrupt factor bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVDHSTR" -->
            <field>
              <name>LVDHSTR</name>
              <description>Voltage of VCC is higher than the setting of SVHRLI</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CLR" -->
        <register>
          <name>LVD_CLR</name>
          <description>Low-voltage Detection Interrupt Factor Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8080</resetValue>
          <resetMask>0x8080</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVD2CL" -->
            <field>
              <name>LVD2CL</name>
              <description>Low-voltage detection 2 interrupt factor clear bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDCL" -->
            <field>
              <name>LVDCL</name>
              <description>Low-voltage detection interrupt factor clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
