cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xd.svd
        <!-- REGISTER "WIER" -->
        <register>
          <name>WIER</name>
          <description>Deep Standby Return Enable Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI11E" -->
            <field>
              <name>WUI11E</name>
              <description>WKUP11 pin input return enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI10E" -->
            <field>
              <name>WUI10E</name>
              <description>WKUP10 pin input return enable bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI9E" -->
            <field>
              <name>WUI9E</name>
              <description>WKUP9 pin input return enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI8E" -->
            <field>
              <name>WUI8E</name>
              <description>WKUP8 pin input return enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI7E" -->
            <field>
              <name>WUI7E</name>
              <description>WKUP7 pin input return enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI6E" -->
            <field>
              <name>WUI6E</name>
              <description>WKUP6 pin input return enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCEC1E" -->
            <field>
              <name>WCEC1E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.1 interrupt return enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCEC0E" -->
            <field>
              <name>WCEC0E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.0 interrupt return enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI5E" -->
            <field>
              <name>WUI5E</name>
              <description>WKUP5 pin input return enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI4E" -->
            <field>
              <name>WUI4E</name>
              <description>WKUP4 pin input return enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3E" -->
            <field>
              <name>WUI3E</name>
              <description>WKUP3 pin input return enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2E" -->
            <field>
              <name>WUI2E</name>
              <description>WKUP2 pin input return enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1E" -->
            <field>
              <name>WUI1E</name>
              <description>WKUP1 pin input return enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WLVDE" -->
            <field>
              <name>WLVDE</name>
              <description>LVD interrupt return enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRTCE" -->
            <field>
              <name>WRTCE</name>
              <description>RTC interrupt return enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WILVR" -->
        <register>
          <name>WILVR</name>
          <description>WKUP Pin Input Level Register</description>
          <addressOffset>0x710</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI11LV" -->
            <field>
              <name>WUI11LV</name>
              <description>WKUP11 pin input level select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI10LV" -->
            <field>
              <name>WUI10LV</name>
              <description>WKUP10 pin input level select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI9LV" -->
            <field>
              <name>WUI9LV</name>
              <description>WKUP9 pin input level select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI8LV" -->
            <field>
              <name>WUI8LV</name>
              <description>WKUP8 pin input level select bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI7LV" -->
            <field>
              <name>WUI7LV</name>
              <description>WKUP7 pin input level select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI6LV" -->
            <field>
              <name>WUI6LV</name>
              <description>WKUP6 pin input level select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI5LV" -->
            <field>
              <name>WUI5LV</name>
              <description>WKUP5 pin input level select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI4LV" -->
            <field>
              <name>WUI4LV</name>
              <description>WKUP4 pin input level select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3LV" -->
            <field>
              <name>WUI3LV</name>
              <description>WKUP3 pin input level select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2LV" -->
            <field>
              <name>WUI2LV</name>
              <description>WKUP2 pin input level select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1LV" -->
            <field>
              <name>WUI1LV</name>
              <description>WKUP1 pin input level select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSRAMR" -->
        <register>
          <name>DSRAMR</name>
          <description>Deep Standby RAM Retention Register</description>
          <addressOffset>0x714</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRAMR" -->
            <field>
              <name>SRAMR</name>
              <description>On-chip SRAM retention control bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BUR01" -->
        <register>
          <name>BUR01</name>
          <description>Backup Register 01</description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR02" -->
        <register>
          <name>BUR02</name>
          <description>Backup Register 02</description>
          <addressOffset>0x801</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR03" -->
        <register>
          <name>BUR03</name>
          <description>Backup Register 03</description>
          <addressOffset>0x802</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR04" -->
        <register>
          <name>BUR04</name>
          <description>Backup Register 04</description>
          <addressOffset>0x803</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR05" -->
        <register>
          <name>BUR05</name>
          <description>Backup Register 05</description>
          <addressOffset>0x804</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR06" -->
        <register>
          <name>BUR06</name>
          <description>Backup Register 06</description>
          <addressOffset>0x805</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
